# Tap
# ==============================================================================

tap "atlassian/acli"

# Brew
# ==============================================================================

# Symlink farm manager for dotfiles (required by install.sh)
brew "stow"

# Software to interact with Atlassian Cloud from the terminal
brew "atlassian/acli/acli"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# Like neofetch, but much faster because written mostly in C
brew "fastfetch"

# Command-line fuzzy finder written in Go
brew "fzf"

# GitHub command-line tool
brew "gh"

# Syntax-highlighting pager for git and diff output
brew "git-delta"

# Agent multiplexer that lives in your terminal
brew "herdr"

# Improved top (interactive process viewer)
brew "htop"

# Lightweight and flexible command-line JSON processor
brew "jq"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# Manage multiple Node.js versions
brew "nvm"

# Display directories as trees (with optional color/HTML output)
brew "tree"

# Vi 'workalike' with many additional features
brew "vim"

# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"

# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"

# Cask
# ==============================================================================

# Password manager that keeps all passwords secure behind one password
cask "1password"

# App to build and share containerised applications and microservices
cask "docker-desktop"

# Web browser
cask "firefox"

# Monospace font with programming ligatures + Nerd Font glyphs (terminal font)
cask "font-fira-code-nerd-font"

# Web browser
cask "google-chrome"

# Native desktop AI assistant from Google
cask "google-gemini"

# Speech to text application
cask "handy"

# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"

# Utility to hide menu bar items
cask "hiddenbar"

# Menu bar calendar
cask "itsycal"

# Open-source keystroke visualiser
cask "keycastr"

# Tool to control external monitor brightness & volume
cask "monitorcontrol"

# Control your tools with a few keystrokes
cask "raycast"

# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"

# Email client
cask "readdle-spark"

# System monitor for the menu bar
cask "stats"

# Messaging app with a focus on speed and security
cask "telegram"

# Native desktop client for WhatsApp
cask "whatsapp"

# Multiplayer code editor written in Rust
cask "zed"
