tap "atlassian/acli"
tap "cloudflare/cloudflare"
tap "ngrok/ngrok"
# Symlink farm manager for dotfiles (required by install.sh)
brew "stow"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# User-friendly launcher for Bazel
brew "bazelisk"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Agent multiplexer that lives in your terminal
brew "herdr"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# Keep your Mac's application settings in sync
brew "mackup"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@17"
# Highly capable, feature-rich programming language
brew "perl"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Syntax-aware linter for prose
brew "vale"
# Vi 'workalike' with many additional features
brew "vim"
# Watch files and take action when they change
brew "watchman"
# Hackable, minimal, fast TUI file explorer
brew "xplr"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Reimagine your terminal
# cask "fig"  # discontinued (became Amazon Q) - reinstall manually if wanted
# Utility to hide menu bar items
cask "hiddenbar"
# Open-source keystroke visualiser
cask "keycastr"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok/ngrok/ngrok", trusted: true
vscode "chakra-ui.panda-css-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "orta.vscode-jest"
vscode "sleistner.vscode-fileutils"
vscode "tyriar.lorem-ipsum"
vscode "unifiedjs.vscode-mdx"
vscode "yoavbls.pretty-ts-errors"
npm "@anthropic-ai/claude-agent-sdk"
npm "@google/gemini-cli"
npm "corepack"
